In [1]:
import pandas as pd

In [4]:
sample1 = pd.read_csv('sample/sample1.csv', encoding = "UTF-8")
sample1

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [5]:
sample2 = pd.read_csv('sample/sample2.csv', encoding = "UTF-8", names = ['c1','c2','c3'])
sample2

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [6]:
sample1 = pd.read_csv('sample/sample1.csv', encoding = "UTF-8", index_col = 'c1')

In [7]:
sample1

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [12]:
sample3 = pd.read_table('sample/sample3.txt', sep='\t', encoding='utf-8')

In [13]:
sample3

         C1        C2        C3       C4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [15]:
sample4 = pd.read_csv('sample/sample4.txt', skiprows = [0,1])
sample4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [18]:
sample5 = pd.read_csv('sample/sample5.csv', na_values = ['누락'])

In [19]:
sample5

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [21]:
sample5.to_csv('sample/sample6.csv')

In [23]:
sample5.to_csv('sample/sample7.txt', sep = '|')

In [25]:
sample5.to_csv('sample/sample8.txt', na_rep = '누락')

In [26]:
sample5.to_csv('sample/sample9.txt',index = False, header = False)

In [27]:
sample5.to_csv('sample/sample10.txt', index =False , header = True, na_rep = "누락")

In [28]:
sample5

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three